inletTest11/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.15;       // 5% turbulent intensity
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    symmetryLine
    {
        type            symmetryPlane;
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    rightWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        //type            kqRWallFunction;
        //value           $internalField;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
